# skills.py

# スキルリスト
SKILLS = [

	# 確率系スキル

	{
		"code": "001",
		"name": "天使の加護",
		"description": "10 %の確率で受けるダメージを 0 にする。"
	},
	{
		"code": "002",
		"name": "龍の導き",
		"description": "10 %の確率で攻撃時にダメージをプラス 50 する。"
	},
	{
		"code": "003",
		"name": "選ばれし者",
		"description": "10 %の確率で攻撃ターンを継続する。"
	},

	# エンハンス系スキル

	{
		"code": "004",
		"name": "大地の恵み",
		"description": "HPがプラス 30 された状態でモンスターが生成される。"
	},
	{
		"code": "005",
		"name": "灼熱の怒り",
		"description": "攻撃がプラス 15 された状態でモンスターが生成される。"
	},
	{
		"code": "006",
		"name": "鋼の肉体",
		"description": "防御がプラス 10 された状態でモンスターが生成される。"
	},

	# 特殊系スキル

	{
		"code": "007",
		"name": "パーフェクトトレース",
		"description": "任意で相手モンスターのステータスをコピーできる。"
	},
	{
		"code": "008",
		"name": "不屈の精神",
		"description": "1 ゲームに 1 度だけ相手のリーサルに耐えることができる。"
	},
	{
		"code": "009",
		"name": "ファンタジスタ",
		"description": "自分の出題時の最後の文字を好きな行から選び固定できる。"
	},

	# はずれスキル

	{
		"code": "010",
		"name": "平凡",
		"description": "なにもない。"
	},

]